{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Bluetooth Speaker Display, Processor Page, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file that defines CSS custom property tokens for light and dark themes used by shadcn/ui components.",
  "frontend/index.html": "HTML entry point for the UltraSound Pro app, mounting the React app at the #root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root application component managing global state (EQ gains, instrument gains, active tab, sound engine) and wiring together all hooks and UI panels including player, processor, and Bluetooth speaker tabs.",
  "frontend/src/components/AudioEngineFallback.tsx": "Fallback UI component displayed when the Web Audio API is unavailable, showing a styled warning message with browser recommendations.",
  "frontend/src/components/BatteryWidget.tsx": "Displays an animated battery charge widget with fill level, charging wattage, output power, and gold glow effects driven by the useBatteryCharging hook state.",
  "frontend/src/components/BluetoothSpeakerDisplay.tsx": "Renders 2–3 animated Bluetooth speaker illustrations with pulsing cones driven by real-time audio amplitude from the Web Audio API, displaying live output power in watts and dB level.",
  "frontend/src/components/EQStabilizer.tsx": "A React component rendering a 20-band EQ grid (4 rows × 5 columns) with per-band gain sliders and per-instrument gain sliders, debouncing changes to the audio engine and highlighting active bands/instruments.",
  "frontend/src/components/Equalizer.tsx": "Empty file with no content.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors in child components and displays a named error panel with a retry button.",
  "frontend/src/components/FilePicker.tsx": "A drag-and-drop plus browse file picker component that accepts common audio formats and calls a callback with the selected files, showing an error message if provided.",
  "frontend/src/components/Header.tsx": "The app header component displaying the UltraSound Pro logo, title, and a SoundEngineSelector for switching between audio engines.",
  "frontend/src/components/InstrumentControls.tsx": "Empty file with no content.",
  "frontend/src/components/PlayerControls.tsx": "A playback control panel showing track info, play/pause/stop/skip buttons, a seek bar with time display, and a playback error banner.",
  "frontend/src/components/Playlist.tsx": "Renders a scrollable playlist of audio files with active-track highlighting, format badges, duration display, and per-track remove buttons.",
  "frontend/src/components/ProcessorPage.tsx": "A visualizer page showing animated frequency bars, smart chip cards with monitor indicators, processor class info, and amplitude display driven by the audio engine's analyser node.",
  "frontend/src/components/SoundEngineSelector.tsx": "Renders a row of buttons for selecting one of four named sound engines, highlighting the active engine with a gold style and displaying an icon for each.",
  "frontend/src/components/SoundMagnet.tsx": "Canvas-based animated visualizer that draws concentric glowing rings, radial field lines, and a pulsing core that react to real-time audio analyser amplitude data.",
  "frontend/src/components/SoundMagnetToggle.tsx": "UI toggle component for enabling/disabling the Sound Magnet feature, displaying a styled switch button with ON/OFF state and descriptive labels.",
  "frontend/src/components/SpectrumVisualizer.tsx": "Canvas-based frequency spectrum visualizer that draws animated gold-to-blue bars from an AnalyserNode, with a continuous requestAnimationFrame loop and responsive resizing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, returning either an authenticated or anonymous actor and invalidating dependent queries on identity change.",
  "frontend/src/hooks/useAudioEngine.ts": "Custom hook that manages a Web Audio API pipeline with a 20-band EQ filter chain, gain node, and analyser, exposing controls to initialize the context, connect audio sources, and apply sound engine presets.",
  "frontend/src/hooks/useAudioFiles.ts": "Custom hook for managing a list of local audio files, handling format validation, metadata parsing (name/artist from filename), duration extraction, and object URL lifecycle.",
  "frontend/src/hooks/useAudioPlayer.ts": "React hook that manages audio playback state (play, pause, stop, seek, track selection) using an HTMLAudioElement and integrates with an AudioEngine for Web Audio API processing.",
  "frontend/src/hooks/useBatteryCharging.ts": "React hook that simulates a battery charging animation over 12 seconds using requestAnimationFrame, exposing percentage, wattage, and an isUnlocked flag when fully charged.",
  "frontend/src/hooks/useCanvasAnimation.ts": "Minimal React hook that drives a canvas draw loop via requestAnimationFrame, exposing start and stop controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using DFINITY's AuthClient, managing login status, identity persistence, and delegation validity.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module with no backend queries, exported as an empty module for a client-side-only app.",
  "frontend/src/hooks/useSoundMagnet.ts": "Simple React hook that tracks an on/off toggle state for a 'sound magnet' feature.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind, imports Orbitron/Rajdhani/Inter fonts, defines CSS custom properties for the dark sci-fi theme, and provides reusable utility classes for glass panels, glows, and EQ sliders.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/audioConstants.ts": "Defines the 20 EQ frequency bands, gain limits, frequency labels, and preset gain curves for four named sound engine modes.",
  "frontend/src/utils/debounce.ts": "Generic debounce utility that delays invoking a function until after a specified delay since the last call.",
  "frontend/src/utils/instrumentMappings.ts": "Maps 20 musical instruments to their corresponding single EQ band index (0–19), each with display name, emoji, icon path, and color for UI rendering.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Orbitron, Rajdhani, Inter), oklch-based color tokens, custom 'ultra' brand colors, glow box shadows, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (version 21) describing an ultra-premium single-file music player web app with Web Audio API, 20-band EQ linked to 20 instrument controls, battery-lock playback system, canvas visualizer, and known issues around layout, EQ panel sizing, and file picker playback."
}