{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (visual theme, layout, file picker, player controls, etc.) to their implementing source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's frontend architecture.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes used by shadcn/ui components.",
  "frontend/index.html": "HTML shell for the React app titled 'UltraSound Pro' that mounts the app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component that wires together all hooks (audio engine, files, player, battery) and renders the four-region layout (Header, left panel, center panel, bottom panel) with error boundaries.",
  "frontend/src/components/AudioEngineFallback.tsx": "Fallback UI component displayed when the Web Audio API is unavailable, showing a styled warning with browser recommendations.",
  "frontend/src/components/BatteryWidget.tsx": "Animated battery charging widget that visualizes charge percentage with a rising fill, lightning bolt animations, wattage counters, and a glow effect when fully charged.",
  "frontend/src/components/Equalizer.tsx": "20-band equalizer component rendering vertical sliders for each frequency band with debounced audio engine updates, gain value labels, and highlighted band indicators linked to instrument controls.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches rendering errors within a named section and displays an error message with a retry button to reset the error state.",
  "frontend/src/components/FilePicker.tsx": "A file picker component supporting drag-and-drop and browse-button file selection for audio formats, with visual drag feedback and error display.",
  "frontend/src/components/Header.tsx": "The app header displaying the UltraSound Pro logo, title, and a sound engine selector component.",
  "frontend/src/components/InstrumentControls.tsx": "Renders a grid of 20 instrument sliders that map to EQ band gains, with debounced updates to the audio engine and visual highlighting for active instruments.",
  "frontend/src/components/PlayerControls.tsx": "Displays playback controls (play, pause, stop, skip), a seek bar, and current track info including name, artist, and playback status.",
  "frontend/src/components/Playlist.tsx": "Renders a scrollable playlist of audio files with track selection, format badges, duration display, and per-track remove functionality.",
  "frontend/src/components/SoundEngineSelector.tsx": "A button group component for selecting among four named sound engines, highlighting the currently active one.",
  "frontend/src/components/SpectrumVisualizer.tsx": "A React canvas component that renders a real-time frequency spectrum analyzer using Web Audio API data, drawing gold-to-blue gradient bars with glow effects and falling back to a flat idle line when no analyser is available.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudioEngine.ts": "A React hook that manages a Web Audio API pipeline consisting of a 20-band BiquadFilter EQ chain, a gain node, and an analyser node, exposing controls to initialize the context, connect/disconnect audio sources, and adjust filter gains.",
  "frontend/src/hooks/useAudioFiles.ts": "A React hook that manages a list of local audio files, handling format validation, metadata parsing (name/artist from filename), duration extraction, and object URL lifecycle.",
  "frontend/src/hooks/useAudioPlayer.ts": "A React hook that controls an HTMLAudioElement for playlist playback, providing play/pause/stop/seek/next/previous actions and tracking playback state, current time, and the active track.",
  "frontend/src/hooks/useBatteryCharging.ts": "A React hook that simulates a battery charging animation over 12 seconds using requestAnimationFrame, exposing percentage, wattage, and an isUnlocked flag that becomes true when fully charged.",
  "frontend/src/hooks/useCanvasAnimation.ts": "A minimal React hook that wraps a requestAnimationFrame loop, exposing start and stop controls for running a provided draw function continuously.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication via DFINITY's AuthClient, managing login status, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for backend queries; exports nothing since the app is client-side only.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind and Google Fonts, defining CSS custom properties for the dark blue/gold theme, glassmorphism utilities, glow effects, and custom range slider styling.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/audioConstants.ts": "Defines the 20 EQ frequency bands, gain range constants, frequency labels, and preset gain curves for the four named sound engines.",
  "frontend/src/utils/debounce.ts": "Generic debounce utility that delays invoking a function until after a specified delay has elapsed since the last call.",
  "frontend/src/utils/instrumentMappings.ts": "Defines 20 instrument objects, each mapping a name, emoji, color, and the specific EQ frequency band indices that instrument occupies.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts (Orbitron, Rajdhani, Inter), gold/blue glow shadows, OKLCH-based color tokens, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest describing the ultra-premium music player app's architecture, existing features, known issues, and image requirements at schema version 3."
}