{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report describing two high-confidence features focused on fixing the audio playback pipeline and integrating useAudioFiles, useAudioPlayer, and useAudioEngine hooks in App.tsx.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and recent changes, covering hooks, components, utilities, and styles for the UltraSound Pro app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom property tokens for the shadcn/ui design system.",
  "frontend/index.html": "HTML shell for the UltraSound Pro React app, mounting the root div and loading the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root application component that wires together audio engine, file management, player, battery, EQ, and instrument hooks, and composes all major UI sections including playlist, controls, visualizer, and EQ stabilizer.",
  "frontend/src/components/AudioEngineFallback.tsx": "Fallback UI component displayed when the Web Audio API is unavailable, prompting the user to switch to a modern browser.",
  "frontend/src/components/BatteryWidget.tsx": "Visual battery widget component that animates charge level, wattage, and unlock state using the BatteryState from the useBatteryCharging hook.",
  "frontend/src/components/EQStabilizer.tsx": "20-band EQ and instrument mixer panel rendered as a 4×5 grid of sliders, with debounced gain updates synced bidirectionally between EQ bands and instruments.",
  "frontend/src/components/Equalizer.tsx": "Empty file with no exported content.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches rendering errors in child components and displays a styled error message with a retry button to reset the error state.",
  "frontend/src/components/FilePicker.tsx": "A drag-and-drop file picker component that accepts audio files (MP3, WAV, FLAC, OGG, AAC) via drag-and-drop or a file browser dialog, with error display support.",
  "frontend/src/components/Header.tsx": "The app header component displaying the UltraSound Pro logo, title, and a sound engine selector for switching between audio engines.",
  "frontend/src/components/InstrumentControls.tsx": "An empty file with no content or exports.",
  "frontend/src/components/PlayerControls.tsx": "A playback control component showing track info, play/pause/stop/skip buttons, a seek bar, and a playback error banner with dismiss functionality.",
  "frontend/src/components/Playlist.tsx": "A scrollable playlist component that lists loaded audio files with track number, name, artist, duration, and format badge, highlighting the currently active/playing track and supporting track selection and removal.",
  "frontend/src/components/SoundEngineSelector.tsx": "A button-group component for selecting among four named sound engines (Crystal, Deep Bass, Surround, Pure HD), highlighting the active selection with gold styling.",
  "frontend/src/components/SpectrumVisualizer.tsx": "A canvas-based real-time spectrum analyzer that renders frequency bar data from a Web Audio API analyser node with a gold-to-blue color gradient and a background hero image.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, returning an anonymous actor when unauthenticated and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioEngine.ts": "Custom React hook that manages a Web Audio API pipeline with a 20-band EQ filter chain, gain node, and analyser node, exposing controls to initialize the AudioContext, connect/disconnect audio sources, and adjust filter gains.",
  "frontend/src/hooks/useAudioFiles.ts": "Custom React hook for managing a playlist of audio files, handling file validation, metadata parsing (name/artist from filename), duration extraction, and object URL lifecycle.",
  "frontend/src/hooks/useAudioPlayer.ts": "Custom React hook that controls audio playback (play, pause, stop, seek, track selection) using an HTMLAudioElement wired to the audio engine, tracking playback state and errors.",
  "frontend/src/hooks/useBatteryCharging.ts": "Custom React hook that simulates a battery charging animation over 12 seconds using requestAnimationFrame, exposing percentage, wattage, and an isUnlocked flag when fully charged.",
  "frontend/src/hooks/useCanvasAnimation.ts": "Minimal React hook that drives a requestAnimationFrame loop, calling a provided draw function each frame with start/stop controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Computer Internet Identity authentication, wrapping AuthClient to handle login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module with no implementation, indicating no backend queries are needed for this client-side-only app.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Orbitron/Rajdhani/Inter fonts, defines CSS custom properties for a dark sci-fi theme with gold/blue glow effects, and includes utility component classes like glass panels and a vertical EQ slider.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/utils/audioConstants.ts": "Defines 20-band EQ frequency values, gain limits, frequency labels, and four named sound engine presets (Crystal, Deep Bass, Surround, Pure HD) as gain arrays.",
  "frontend/src/utils/debounce.ts": "Exports a generic debounce utility that delays function execution until a specified millisecond delay has passed since the last call.",
  "frontend/src/utils/instrumentMappings.ts": "Maps each of the 20 EQ frequency bands to a specific instrument with name, emoji, icon path, band index, and color, establishing a 1-to-1 instrument-to-EQ-band relationship.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts (Orbitron, Rajdhani, Inter), oklch-based semantic colors, gold/blue glow shadows, and app-specific 'ultra' color palette, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 19) for an ultra-premium music player app, documenting existing features, architectural notes, and known issues such as broken file picker playback and oversized EQ panel."
}