{
  "backend/main.mo": "Main Motoko actor implementing user profile storage, key-value entry management, and access-controlled endpoints using AccessControl, MixinAuthorization, and MixinStorage mixins.",
  "feature_evidence.json": "Feature evidence report mapping the UltraSound Pro full-copy feature to its constituent frontend files, component dependencies, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries for each frontend source file, serving as a reference index for the UltraSound Pro project's components, hooks, and utilities.",
  "frontend/index.css": "Root CSS file with Tailwind directives and OKLCH-based CSS custom properties defining light and dark theme tokens for backgrounds, borders, charts, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the UltraSound Pro app, setting the page title, favicon, viewport meta, and mounting the React app via /src/main.tsx.",
  "frontend/src/App.tsx": "Root React component orchestrating all hooks and UI sections (player, BT speakers, processor tabs) with EQ state, engine selection, playlist management, and playback controls.",
  "frontend/src/components/AudioEngineFallback.tsx": "Fallback UI component displayed when the Web Audio API is unsupported, showing a styled message with browser recommendations.",
  "frontend/src/components/BatteryWidget.tsx": "Animated battery charging widget displaying percentage fill, stored/charger/output power stats, and lock/unlock messages based on BatteryState.",
  "frontend/src/components/BluetoothSpeakerDisplay.tsx": "Real-time Bluetooth speaker visualization component that reads analyser frequency data and animates three speaker images with dB, wattage, scale, and glow per speaker.",
  "frontend/src/components/EQStabilizer.tsx": "Renders a grid of EQ band sliders and instrument gain sliders, applying debounced updates to the audio engine and displaying boost/cut/center counts in a legend.",
  "frontend/src/components/Equalizer.tsx": "Empty file with no content or exports.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors, displays an error message with a retry button, and optionally labels the failing section.",
  "frontend/src/components/FilePicker.tsx": "Provides a drag-and-drop file upload zone and a stream URL input field, passing selected audio files or stream URLs to parent callbacks.",
  "frontend/src/components/Header.tsx": "Renders the app header with the UltraSound Pro logo, title, and a sound engine selector component.",
  "frontend/src/components/InstrumentControls.tsx": "Empty file with no content or exports.",
  "frontend/src/components/PlayerControls.tsx": "Displays playback controls (play/pause, skip, seek bar, volume) for the current track, with special handling for live streams and an error banner.",
  "frontend/src/components/Playlist.tsx": "Renders a scrollable list of audio tracks with active/playing indicators, format badges, and per-track remove buttons; shows an empty state when no tracks are loaded.",
  "frontend/src/components/ProcessorPage.tsx": "Displays a real-time DSP processor dashboard with animated chip status cards, a 32-bar frequency visualizer, and auto-detected/auto-fixed audio issues driven by an animation loop.",
  "frontend/src/components/SoundEngineSelector.tsx": "Renders a row of buttons for selecting one of four named sound engines, highlighting the active selection with gold styling.",
  "frontend/src/components/SoundMagnet.tsx": "Canvas-based animated visualizer that draws concentric rings, rotating spokes, and a pulsing core driven by real-time audio analyser data, showing an OFF state when disabled.",
  "frontend/src/components/SoundMagnetToggle.tsx": "Toggle button with a magnet icon that switches the Sound Magnet feature on or off, updating its styling to reflect the current state.",
  "frontend/src/components/SpectrumVisualizer.tsx": "Canvas-based frequency spectrum visualizer that draws 64 color-gradient bars from analyser data when playing, or faint idle bars when stopped.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the identity or actor changes.",
  "frontend/src/hooks/useAudioEngine.ts": "Defines an AudioEngine class that manages a Web Audio API chain (20-band EQ filters, gain node, analyser) and exposes a singleton-backed React hook for interacting with it.",
  "frontend/src/hooks/useAudioFiles.ts": "Hook that manages a list of local audio files and stream URLs, handling format validation, object URL lifecycle, duration extraction, and add/remove operations.",
  "frontend/src/hooks/useAudioPlayer.ts": "Hook that controls an HTMLAudioElement for playback (play, pause, resume, seek, volume), wiring it through the AudioEngine and exposing reactive player state.",
  "frontend/src/hooks/useBatteryCharging.ts": "Hook that simulates a 12-second battery charge animation using requestAnimationFrame, exposing percentage, watts, output power, and an unlocked flag.",
  "frontend/src/hooks/useCanvasAnimation.ts": "Utility hook that wraps a draw function in a requestAnimationFrame loop with start/stop controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module that satisfies the import structure for a queries hook; no actual queries are implemented.",
  "frontend/src/hooks/useSoundMagnet.ts": "Simple React hook that manages a boolean on/off toggle state with a memoized toggle callback.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind directives and Google Fonts, defining CSS variables for the app's dark/gold/blue theme, glassmorphism panels, custom scrollbars, and EQ slider styles.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/audioConstants.ts": "Defines EQ frequency bands, gain limits, frequency labels, and named sound engine presets (gain arrays) used by the audio equalizer.",
  "frontend/src/utils/debounce.ts": "Generic debounce utility that delays invoking a function until after a specified delay has elapsed since the last call.",
  "frontend/src/utils/instrumentMappings.ts": "Defines 20 instrument definitions (id, name, emoji, icon path, color, band index) and a reverse lookup array mapping EQ band indices to instrument array indices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts, gold/blue/dark brand colors, shadcn/ui OKLCH color tokens, glow box shadows, and accordion animations.",
  "project_state.json": "Tracks the current state of an ultra-premium music player web app (version 31), documenting its architecture, existing features, and known issues including broken audio playback, non-functional Smart Chips, and UI layout problems."
}