{
  "kind": "build_request",
  "title": "Fix file picker audio playback — selected files do not play",
  "projectName": "UltraSound Pro",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Fix the audio playback pipeline so that when a user selects audio files via the file picker (drag-and-drop or browse) and clicks a track in the playlist, the audio actually plays. The issue is that files can be selected and appear in the playlist but clicking Play or selecting a track does not produce any sound. Ensure the object URL created from the selected File is correctly assigned to the HTMLAudioElement src, the AudioContext is resumed (it may be in 'suspended' state due to browser autoplay policy), the source node is connected to the audio engine filter chain, and the play() promise is awaited and any rejection is caught and logged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Let's get file window picker to play ok it does not play"
        ]
      },
      "acceptanceCriteria": [
        "Selecting one or more audio files (MP3, WAV, FLAC, OGG, AAC) via the file picker adds them to the playlist.",
        "Clicking a track in the playlist loads it into the player and begins playback automatically (or on pressing Play), producing audible sound.",
        "The AudioContext is resumed from 'suspended' state before playback starts to satisfy browser autoplay policy.",
        "The HTMLAudioElement src is correctly set to the object URL of the selected file before play() is called.",
        "The media element source node is properly connected to the 20-band EQ filter chain → GainNode → AnalyserNode → destination before playback.",
        "If the play() promise rejects, the error is caught and a visible error message is shown to the user.",
        "Subsequent track selections (Next, Previous, clicking another playlist item) also play audio correctly.",
        "The Play/Pause/Stop controls in PlayerControls respond correctly once a track is loaded and the battery is at 100%.",
        "No console errors related to AudioContext state, disconnected nodes, or unhandled promise rejections during normal playback."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Audit and fix the integration between useAudioFiles.ts, useAudioPlayer.ts, and useAudioEngine.ts in App.tsx to ensure the full data flow works end-to-end: (1) file selection → object URL creation in useAudioFiles, (2) track selection → src assignment on the HTMLAudioElement in useAudioPlayer, (3) AudioContext initialization and source node connection in useAudioEngine when a new track is loaded, (4) play() invocation after the source is connected. Fix any missing wiring, incorrect hook dependency, or race condition that prevents playback from starting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "it does not play"
        ]
      },
      "acceptanceCriteria": [
        "App.tsx correctly passes the selected track's object URL to the player hook when a playlist item is clicked.",
        "useAudioPlayer correctly sets the HTMLAudioElement src and calls play() after the audio engine source node is connected.",
        "useAudioEngine.ts initializes or resumes the AudioContext and creates/reconnects the MediaElementSourceNode whenever a new track src is assigned.",
        "No duplicate MediaElementSourceNode creation errors ('InvalidStateError') occur when switching tracks.",
        "The SpectrumVisualizer receives valid AnalyserNode data and animates while audio is playing."
      ]
    }
  ],
  "constraints": [
    "Do not change backend/main.mo — no backend changes needed.",
    "Do not modify any files listed in frontend.immutablePaths.",
    "Preserve all existing EQ Stabilizer layout, instrument mappings, and bidirectional linking functionality.",
    "Preserve the battery lock system — player controls must remain locked until battery reaches 100%."
  ],
  "nonGoals": [
    "Changing the visual design or layout of the file picker, playlist, or player controls.",
    "Adding new audio formats beyond MP3, WAV, FLAC, OGG, AAC.",
    "Modifying the battery charging animation or unlock logic.",
    "Changing the EQ Stabilizer panel layout or instrument mappings."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}