{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Build Bluetooth Speaker Display, Smart Chip Processor Page, and Sound Magnet feature",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Build Bluetooth Speaker Display panel showing 2–3 animated speaker illustrations with live output power (watts) and dB level driven by Web Audio API analyser/gain node, speaker cone animation synced to music amplitude",
      "acceptanceCriteria": [
        "2–3 Bluetooth speaker illustrations are visible on screen within a dedicated panel",
        "Live wattage output and dB level are displayed and update in real time as audio plays",
        "Speaker cone animation pulses/moves in sync with music amplitude",
        "Panel uses the existing dark glassmorphism style with gold/blue glow accents",
        "Panel is titled 'BLUETOOTH SPEAKER OUTPUT'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BluetoothSpeakerDisplay.tsx",
          "operation": "create",
          "description": "Create a React component that renders the Bluetooth Speaker Output panel. Display 2–3 animated speaker illustrations using the generated image frontend/public/assets/generated/bluetooth-speaker.dim_120x120.png. Each speaker shows a pulsing/moving speaker cone driven by the current audio amplitude from the analyserNode prop. Display live output power in watts (calculated from gain node output) and dB level (calculated from analyser data) updated in real time. Use dark glassmorphism card style with gold/blue glow accents. Title the panel 'BLUETOOTH SPEAKER OUTPUT'. Accept analyserNode and gainNode as props to read live audio data."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render the BluetoothSpeakerDisplay component in the main app layout. Pass the analyserNode and gainNode from the useAudioEngine hook as props to the component. Position the panel below the spectrum visualizer or in a dedicated section of the layout to ensure it is visible and integrated with the existing UI flow."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Build a dedicated Processor page titled 'NUMBER 1 PROCESSOR IN THE WHOLE WORLD' displaying four custom processor classes (Class A+/B/C+/D), 20 Smart Chip cards with status indicators, Smart Chip Stabilizer range, Automatic Frequency Control with live animated indicator from AnalyserNode, and battery charge level from useBatteryCharging hook",
      "acceptanceCriteria": [
        "Processor page/panel is accessible from the app and titled 'NUMBER 1 PROCESSOR IN THE WHOLE WORLD'",
        "Header displays Class A+ / Class B / Class C+ / Class D with 'More Super Clean Sound Control' subtitle",
        "20 Smart Chip cards are rendered, each showing status indicators for Boost, Effect, Lagging, Clipping, Stuttering, Zero Background Noise",
        "Smart Chip Stabilizer range 80,000–90,000 is displayed",
        "Automatic Frequency Control section shows a live animated indicator driven by the audio AnalyserNode",
        "Battery charge level from useBatteryCharging is shown in the processor panel",
        "All sections use dark glassmorphism card style with gold/blue glow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProcessorPage.tsx",
          "operation": "create",
          "description": "Create a React component rendering the full Processor page. Title: 'NUMBER 1 PROCESSOR IN THE WHOLE WORLD'. Header section: display 'Class A+ / Class B / Class C+ / Class D' with subtitle 'More Super Clean Sound Control — Not Your Standard Regular Classes'. Main content: (1) Render 20 Smart Chip cards in a grid layout, each card showing the chip number and status indicators (Boost, Effect, Lagging, Clipping, Stuttering, Zero Background Noise) as icon badges or colored indicators. (2) Display '80Hz Deep Low Manager — controlled by the Smart Chip Stabilizer'. (3) Show 'Smart Chip Stabilizer' range: 80,000–90,000. (4) Render 'Intelligent Amp' section: 'Does NOT Limit Music — It CORRECTS It — It Is A Stabilizer'. (5) Display 'Full Stabilizer Power — Super Amp Control — Super Modes for Everything'. (6) Automatic Frequency Control section with a live animated indicator (bar/ring/wave) that responds to frequency content from the analyserNode prop. (7) Special DAW VST Generator section: 'Big Grant FPGA, CPU Booster, Signal Stimulation'. (8) Spec readout: '12 Volt — Best Processor World — 20 Core — 30 Thunders Wide'. (9) Display battery charge level from the batteryState prop (useBatteryCharging hook). Use dark glassmorphism card style with gold/blue glow for all sections. Accept analyserNode and batteryState as props."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render the ProcessorPage component in the main app layout. Pass the analyserNode from useAudioEngine and batteryState from useBatteryCharging as props. Position the processor page/panel as an expandable section or a dedicated route accessible from the main UI. Ensure it integrates with the existing layout without disrupting the current player controls, EQ, or visualizer."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Build a Sound Magnet feature with a large animated radial field visualization that grows with audio amplitude, simulating room-filling sound, with a clearly visible ON/OFF toggle labeled 'SOUND MAGNET'",
      "acceptanceCriteria": [
        "Sound Magnet panel/overlay is visible in the app with an ON/OFF toggle labeled 'SOUND MAGNET'",
        "When ON, a large animated radial field (concentric glowing rings or expanding gradient) is rendered and grows in size proportional to the current audio amplitude from the AnalyserNode",
        "The visual field is clearly larger than the speaker illustration, representing room-filling sound",
        "Animation uses gold/yellow glow colors matching the app theme",
        "When OFF, the animation is fully hidden",
        "Toggle is clearly accessible and labeled"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSoundMagnet.ts",
          "operation": "create",
          "description": "Create a custom React hook to manage the Sound Magnet ON/OFF state. Return the current magnet state (boolean) and a toggle function. Use useState to track the ON/OFF state and persist it in component state (no backend persistence required)."
        },
        {
          "path": "frontend/src/components/SoundMagnet.tsx",
          "operation": "create",
          "description": "Create a React component rendering the Sound Magnet visualization. Accept analyserNode and isOn props. When isOn is true, render a large animated radial field (concentric glowing rings or expanding radial gradient) in the center panel or as an overlay. The field size and animation intensity are driven by the current audio amplitude from the analyserNode (read average amplitude or RMS from analyser data). Use gold/yellow glow colors matching the app theme. The visual field must be clearly larger than the speaker illustration to represent room-filling sound. When isOn is false, hide the animation completely. Use CSS animations or canvas/SVG rendering for smooth visuals."
        },
        {
          "path": "frontend/src/components/SoundMagnetToggle.tsx",
          "operation": "create",
          "description": "Create a React component rendering the Sound Magnet ON/OFF toggle switch. Accept isOn and onToggle props. Render a clearly labeled button or switch control with the label 'SOUND MAGNET'. Use the existing UI styling (glassmorphism card, gold/blue glow) to match the app theme. When clicked, call onToggle to change the magnet state."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and wire the Sound Magnet feature into the app. Use the useSoundMagnet hook to manage the ON/OFF state. Render the SoundMagnetToggle component in a visible location (e.g., near the player controls or in a settings panel). Render the SoundMagnet component in a dedicated section or as an overlay, passing the analyserNode from useAudioEngine and the isOn state from useSoundMagnet. Ensure the toggle is clearly accessible and the animation integrates with the existing layout."
        }
      ]
    }
  ]
}