{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix file picker audio playback — selected files do not play",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Fix the audio playback pipeline so selected audio files play when clicked in the playlist, ensuring AudioContext is resumed, object URLs are correctly assigned to HTMLAudioElement, source nodes are connected to the filter chain, and play() promises are properly handled",
      "acceptanceCriteria": [
        "Selecting one or more audio files (MP3, WAV, FLAC, OGG, AAC) via the file picker adds them to the playlist.",
        "Clicking a track in the playlist loads it into the player and begins playback automatically (or on pressing Play), producing audible sound.",
        "The AudioContext is resumed from 'suspended' state before playback starts to satisfy browser autoplay policy.",
        "The HTMLAudioElement src is correctly set to the object URL of the selected file before play() is called.",
        "The media element source node is properly connected to the 20-band EQ filter chain → GainNode → AnalyserNode → destination before playback.",
        "If the play() promise rejects, the error is caught and a visible error message is shown to the user.",
        "Subsequent track selections (Next, Previous, clicking another playlist item) also play audio correctly.",
        "The Play/Pause/Stop controls in PlayerControls respond correctly once a track is loaded and the battery is at 100%.",
        "No console errors related to AudioContext state, disconnected nodes, or unhandled promise rejections during normal playback."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAudioPlayer.ts",
          "operation": "modify",
          "description": "Ensure that when play() is called, the AudioContext is resumed if suspended, the HTMLAudioElement src is set to the current track's object URL before playback starts, and the play() promise is awaited with proper error handling that catches and logs rejections. Add error state to expose playback errors to the UI."
        },
        {
          "path": "frontend/src/hooks/useAudioEngine.ts",
          "operation": "modify",
          "description": "Fix the AudioContext initialization and source node connection logic to ensure the context is resumed from 'suspended' state before playback, the MediaElementSourceNode is created only once per HTMLAudioElement (avoiding 'InvalidStateError'), and the source node is properly connected to the 20-band EQ filter chain → GainNode → AnalyserNode → destination. Expose AudioContext state and connection status."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Pass playback error state from useAudioPlayer to PlayerControls or render an error toast/banner when play() fails. Ensure that when a playlist track is selected, the object URL is passed to the player and the audio engine is notified to reconnect the source node if needed."
        },
        {
          "path": "frontend/src/components/PlayerControls.tsx",
          "operation": "modify",
          "description": "Display playback error messages passed from App.tsx when play() promise rejects. Ensure the Play button triggers playback only after the audio engine source is connected and the AudioContext is running."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Audit and fix the integration between useAudioFiles.ts, useAudioPlayer.ts, and useAudioEngine.ts in App.tsx to ensure file selection → object URL creation → track selection → src assignment → AudioContext initialization → source node connection → play() invocation works end-to-end without race conditions or missing wiring",
      "acceptanceCriteria": [
        "App.tsx correctly passes the selected track's object URL to the player hook when a playlist item is clicked.",
        "useAudioPlayer correctly sets the HTMLAudioElement src and calls play() after the audio engine source node is connected.",
        "useAudioEngine.ts initializes or resumes the AudioContext and creates/reconnects the MediaElementSourceNode whenever a new track src is assigned.",
        "No duplicate MediaElementSourceNode creation errors ('InvalidStateError') occur when switching tracks.",
        "The SpectrumVisualizer receives valid AnalyserNode data and animates while audio is playing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and fix the integration between useAudioFiles, useAudioPlayer, and useAudioEngine hooks. Ensure that when a track is selected from the playlist, its object URL is passed to useAudioPlayer, which then sets the HTMLAudioElement src and triggers source node reconnection in useAudioEngine before calling play(). Fix any missing dependencies or race conditions that prevent playback from starting."
        },
        {
          "path": "frontend/src/hooks/useAudioPlayer.ts",
          "operation": "modify",
          "description": "Refactor the hook to ensure that when a new track src is set, the audio engine is notified to initialize/reconnect the MediaElementSourceNode before play() is invoked. Add a loading state to prevent play() from being called before the source is connected. Ensure play() is awaited and any rejection is caught."
        },
        {
          "path": "frontend/src/hooks/useAudioEngine.ts",
          "operation": "modify",
          "description": "Refactor the source node connection logic to detect when the HTMLAudioElement src changes, automatically disconnect the old source node if present, create a new MediaElementSourceNode only if one does not exist for the current element, and reconnect it to the filter chain. Expose a 'ready' state that indicates the source is connected and the AudioContext is running."
        },
        {
          "path": "frontend/src/components/SpectrumVisualizer.tsx",
          "operation": "modify",
          "description": "Ensure the component checks that the AnalyserNode is valid and connected before rendering spectrum data. Add a fallback to the flat line when the audio engine is not ready or the analyser has no data."
        }
      ]
    }
  ]
}